###############################################################
#  Generated by:      Cadence Innovus 21.18-s099_1
#  OS:                Linux x86_64(Host ID c2s)
#  Generated on:      Fri Jul 12 15:35:37 2024
#  Design:            single_port_ram
#  Command:           saveDesign Routing/single_port_ram_detailedRoute.enc
###############################################################
current_design single_port_ram
create_clock [get_ports {clk_pad}]  -name clk -period 15.000000 -waveform {0.000000 7.000000}
set_clock_transition  -rise -min 1.875 [get_clocks {clk}]
set_clock_transition  -rise -max 3 [get_clocks {clk}]
set_clock_transition  -fall -min 1.875 [get_clocks {clk}]
set_clock_transition  -fall -max 3 [get_clocks {clk}]
create_clock  -name wr_vir_clk_i -period 15.000000 -waveform {0.000000 7.500000}
set_input_transition -min 1  [get_ports {addr_pad[3]}]
set_input_transition -max 2.5  [get_ports {addr_pad[3]}]
set_input_transition -min 1  [get_ports {addr_pad[2]}]
set_input_transition -max 2.5  [get_ports {addr_pad[2]}]
set_input_transition -min 1  [get_ports {addr_pad[1]}]
set_input_transition -max 2.5  [get_ports {addr_pad[1]}]
set_input_transition -min 1  [get_ports {addr_pad[0]}]
set_input_transition -max 2.5  [get_ports {addr_pad[0]}]
set_load -pin_load -max  5  [get_ports {data_pad[7]}]
set_load -pin_load -min  5  [get_ports {data_pad[7]}]
set_load -pin_load -max  5  [get_ports {data_pad[6]}]
set_load -pin_load -min  5  [get_ports {data_pad[6]}]
set_load -pin_load -max  5  [get_ports {data_pad[5]}]
set_load -pin_load -min  5  [get_ports {data_pad[5]}]
set_load -pin_load -max  5  [get_ports {data_pad[4]}]
set_load -pin_load -min  5  [get_ports {data_pad[4]}]
set_load -pin_load -max  5  [get_ports {data_pad[3]}]
set_load -pin_load -min  5  [get_ports {data_pad[3]}]
set_load -pin_load -max  5  [get_ports {data_pad[2]}]
set_load -pin_load -min  5  [get_ports {data_pad[2]}]
set_load -pin_load -max  5  [get_ports {data_pad[1]}]
set_load -pin_load -min  5  [get_ports {data_pad[1]}]
set_load -pin_load -max  5  [get_ports {data_pad[0]}]
set_load -pin_load -min  5  [get_ports {data_pad[0]}]
set_input_transition -min 1  [get_ports {data_pad[0]}]
set_input_transition -max 2.5  [get_ports {data_pad[0]}]
set_input_transition -min 1  [get_ports {data_pad[1]}]
set_input_transition -max 2.5  [get_ports {data_pad[1]}]
set_input_transition -min 1  [get_ports {data_pad[2]}]
set_input_transition -max 2.5  [get_ports {data_pad[2]}]
set_input_transition -min 1  [get_ports {data_pad[3]}]
set_input_transition -max 2.5  [get_ports {data_pad[3]}]
set_input_transition -min 1  [get_ports {data_pad[4]}]
set_input_transition -max 2.5  [get_ports {data_pad[4]}]
set_input_transition -min 1  [get_ports {data_pad[5]}]
set_input_transition -max 2.5  [get_ports {data_pad[5]}]
set_input_transition -min 1  [get_ports {data_pad[6]}]
set_input_transition -max 2.5  [get_ports {data_pad[6]}]
set_input_transition -min 1  [get_ports {data_pad[7]}]
set_input_transition -max 2.5  [get_ports {data_pad[7]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {addr_pad[3]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {addr_pad[3]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {addr_pad[1]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {addr_pad[1]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[6]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[6]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[4]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[4]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[2]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[2]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[0]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[0]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {addr_pad[2]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {addr_pad[2]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {addr_pad[0]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {addr_pad[0]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[7]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[7]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[5]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[5]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[3]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[3]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[1]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[1]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[6]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[6]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[4]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[4]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[2]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[2]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[0]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[0]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[7]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[7]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[5]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[5]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[3]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[3]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[1]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {data_pad[1]}]
set_clock_uncertainty 0.375 [get_clocks {clk}]
